#include<bits/stdc++.h>

using namespace std;

/**
 * 2xn 직사각형 채우는 방법의 수
 * n을 채우는 방법의 수 -> n=5일시 1+1+1+1+1 / 2+1+1+1 / 1+2+1+1 / 1+1+2+1... / 
 * n은 1000 이하
 * 방법의수 % 10007을 출력하라.
 */

//2x1 채우는법 : 1개
//2x2 채우는법 : 2개
//2x3 채우는법 : 111 21 12 : 3개
//2x4 채우는법 : 1111 211 121 112 22 : 5개
//2x5 채우는법 : 11111 2111 1211 1121 1112 221 212 122 : 8개
// 4 = dp[3] * dp[1] + dp[3-1] = 3 + 2 = 5
//-> 5 = dp[4] * dp[1] + dp[4-1]
//즉 dp[n] = dp[n-1] + dp[n-2] 피보나치.


typedef long long ll;
int N;

int main(){

    cin>>N;
    ll dp[1004];
    dp[1] = 1;
    dp[2] = 2;
    for(int i = 3; i<=N; i++){
        dp[i] = (dp[i-1] + dp[i-2])%10007;
    }
    cout<<dp[N]%10007;


    return 0;
}